In [5]:
!pip install mysql-connector

Collecting mysql-connector
  Downloading mysql-connector-2.2.9.tar.gz (11.9 MB)
     |████████████████████████████████| 11.9 MB 101 kB/s eta 0:00:01    |██████▎                         | 2.3 MB 105 kB/s eta 0:01:31     |████████████▌                   | 4.6 MB 98 kB/s eta 0:01:14     |███████████████████████████     | 10.0 MB 138 kB/s eta 0:00:14     |█████████████████████████████   | 10.7 MB 289 kB/s eta 0:00:04
Building wheels for collected packages: mysql-connector
  Building wheel for mysql-connector (setup.py) ... done
  Created wheel for mysql-connector: filename=mysql_connector-2.2.9-cp38-cp38-linux_x86_64.whl size=247948 sha256=30aae69d64283b694f4bc23e792298930aec68a4925ed65bde98655b7a7bb5fe
  Stored in directory: /home/jovyan/.cache/pip/wheels/57/e4/98/5feafb5c393dd2540e44b064a6f95832990d543e5b4f53ea8f
Successfully built mysql-connector
Installing collected packages: mysql-connector
Successfully installed mysql-connector-2.2.9

In [6]:
import mysql.connector

In [12]:
#Docker Bridge 
#docker inspect container | grep IPAddress
mydb = mysql.connector.connect(
    host = "172.28.0.2",
    user = "root",
    passwd = "123456",)

In [13]:
print(mydb)

<mysql.connector.connection.MySQLConnection object at 0x7f5907fd3f40>

In [33]:
my_cursor = mydb.cursor()

## Create A Database

In [34]:
my_cursor.execute("CREATE DATABASE testdb")

In [35]:
my_cursor

In [36]:
my_cursor.execute("SHOW DATABASES")

In [37]:
for db in my_cursor:
    print(db)

('information_schema',)
('mysql',)
('performance_schema',)
('sys',)
('testdb',)

## Create A Table

In [38]:
mydb = mysql.connector.connect(
    host = "172.28.0.2",
    user = "root",
    passwd = "123456",
    database = "testdb")

In [39]:
my_cursor = mydb.cursor()

In [41]:
my_cursor.execute("CREATE TABLE users (name VARCHAR(255), email VARCHAR(255), age INTEGER(10), \
                   user_id INTEGER AUTO_INCREMENT PRIMARY KEY)")

In [45]:
my_cursor.execute("SHOW TABLES")

In [46]:
for table in my_cursor:
    print(table[0])

users

## Insert One Record Into Table

In [173]:
mydb = mysql.connector.connect(
    host = "172.28.0.2",
    user = "root",
    passwd = "123456",
    database = "testdb")

In [174]:
my_cursor = mydb.cursor()

In [177]:
sqlStuff = "INSERT INTO users (name, email, age) VALUES (%s, %s, %s)"
record1 = ('John', 'john@abc.com', 40, 1)

In [178]:
my_cursor.execute(sqlStuff, record1)
mydb.commit()

In [179]:
my_cursor.execute("SELECT * FROM users")

In [180]:
for record in my_cursor:
    print(record)

('John', 'john@abc.com', 40, 1)
('Tim', 'Tim@abc.com', 20, 2)
('Mary', 'Mary@abc.com', 30, 3)
('Kevin', 'Kevin@abc.com', 18, 4)
('Ironman', 'Ironman@abc.com', 45, 5)
('JohnnyDepp', 'JohnnyDepp@abc.com', 55, 6)

## Insert Many Records Into Table

In [62]:
mydb = mysql.connector.connect(
    host = "172.28.0.2",
    user = "root",
    passwd = "123456",
    database = "testdb")

In [63]:
my_cursor = mydb.cursor()

In [64]:
sqlStuff = "INSERT INTO users (name, email, age) VALUES (%s, %s, %s)"

In [87]:
records = [("Tim", "Tim@abc.com", 20),\
           ("Mary", "Mary@abc.com", 30),\
           ("Kevin", "Kevin@abc.com", 18),\
           ("Ironman", "Ironman@abc.com", 45),\
           ('JohnnyDepp', 'JohnnyDepp@abc.com', 55)\
           ]

In [94]:
#executemany
my_cursor.executemany(sqlStuff, records)
mydb.commit()

## Select Data From Table

In [111]:
mydb = mysql.connector.connect(
    host = "172.28.0.2",
    user = "root",
    passwd = "123456",
    database = "testdb")

In [112]:
my_cursor = mydb.cursor()

In [113]:
my_cursor.execute("SELECT * FROM users")

In [114]:
num_fields = len(my_cursor.description)
field_names = [i[0] for i in my_cursor.description]

In [115]:
print(field_names)
for record in my_cursor:
    print(record)

['name', 'email', 'age', 'user_id']
('John', 'john@abc.com', 40, 1)
('Tim', 'Tim@abc.com', 20, 2)
('Mary', 'Mary@abc.com', 30, 3)
('Kevin', 'Kevin@abc.com', 18, 4)
('Ironman', 'Ironman@abc.com', 45, 5)

In [116]:
my_cursor.execute("SELECT name FROM users")

In [117]:
for record in my_cursor:
    print(record)

('John',)
('Tim',)
('Mary',)
('Kevin',)
('Ironman',)

## Format Our Results

In [148]:
import pandas as pd

In [140]:
mydb = mysql.connector.connect(
    host = "172.28.0.2",
    user = "root",
    passwd = "123456",
    database = "testdb")

In [141]:
my_cursor = mydb.cursor()

In [142]:
my_cursor.execute("SELECT * FROM users")

In [143]:
num_fields = len(my_cursor.description)
field_names = [i[0] for i in my_cursor.description]

In [144]:
df = []

In [145]:
for record in my_cursor:
    df.append(list(record))

In [146]:
df

[['John', 'john@abc.com', 40, 1],
 ['Tim', 'Tim@abc.com', 20, 2],
 ['Mary', 'Mary@abc.com', 30, 3],
 ['Kevin', 'Kevin@abc.com', 18, 4],
 ['Ironman', 'Ironman@abc.com', 45, 5]]

In [149]:
new_df = pd.DataFrame(columns = field_names, data = df)

In [150]:
new_df

      name            email  age  user_id
0     John     john@abc.com   40        1
1      Tim      Tim@abc.com   20        2
2     Mary     Mary@abc.com   30        3
3    Kevin    Kevin@abc.com   18        4
4  Ironman  Ironman@abc.com   45        5

## The Where Clause

In [151]:
mydb = mysql.connector.connect(
    host = "172.28.0.2",
    user = "root",
    passwd = "123456",
    database = "testdb")

In [152]:
my_cursor = mydb.cursor()

In [153]:
my_cursor.execute("SELECT * FROM users WHERE age > 30")

In [154]:
result = my_cursor.fetchall()

In [155]:
for row in result:
    print(row)

('John', 'john@abc.com', 40, 1)
('Ironman', 'Ironman@abc.com', 45, 5)

In [156]:
my_cursor.execute("SELECT * FROM users WHERE name = 'John'")

In [157]:
result = my_cursor.fetchall()

In [158]:
for row in result:
    print(row)

('John', 'john@abc.com', 40, 1)

## The Like Clause and Wildcards

In [191]:
mydb = mysql.connector.connect(
    host = "172.28.0.2",
    user = "root",
    passwd = "123456",
    database = "testdb")

In [192]:
my_cursor = mydb.cursor()

In [193]:
my_cursor.execute("SELECT * FROM users WHERE name LIKE 'J%'")

In [194]:
result = my_cursor.fetchall()

In [195]:
for row in result:
    print(row)

('John', 'john@abc.com', 40, 1)
('JohnnyDepp', 'JohnnyDepp@abc.com', 55, 6)

## Using AND and OR

In [196]:
mydb = mysql.connector.connect(
    host = "172.28.0.2",
    user = "root",
    passwd = "123456",
    database = "testdb")

In [197]:
my_cursor = mydb.cursor()

In [198]:
my_cursor.execute("SELECT * FROM users WHERE name LIKE 'J%' AND age = 55")

In [199]:
result = my_cursor.fetchall()

In [201]:
for row in result:
    print(row)

('JohnnyDepp', 'JohnnyDepp@abc.com', 55, 6)

In [202]:
sqlStuff = "INSERT INTO users (name, email, age) VALUES (%s, %s, %s)"
record1 = ('Tina', 'Tina@abc.com', 25)

In [203]:
my_cursor.execute(sqlStuff, record1)
mydb.commit()

In [219]:
my_cursor.execute("SELECT * FROM users WHERE name LIKE '%I%' OR age = 20")

In [220]:
result = my_cursor.fetchall()

In [221]:
for row in result:
    print(row)

('Tim', 'Tim@abc.com', 20, 2)
('Kevin', 'Kevin@abc.com', 18, 4)
('Ironman', 'Ironman@abc.com', 45, 5)
('Tina', 'Tina@abc.com', 25, 7)

## Updating Records

In [222]:
mydb = mysql.connector.connect(
    host = "172.28.0.2",
    user = "root",
    passwd = "123456",
    database = "testdb")

In [223]:
my_cursor = mydb.cursor()

In [224]:
my_sql = "UPDATE users SET age = 41 WHERE name = 'Kevin'"

In [225]:
my_cursor.execute(my_sql)
mydb.commit()

In [229]:
my_cursor.execute("SELECT * FROM users")

In [230]:
result = my_cursor.fetchall()

In [231]:
for row in result:
    print(row)

('John', 'john@abc.com', 40, 1)
('Tim', 'Tim@abc.com', 20, 2)
('Mary', 'Mary@abc.com', 30, 3)
('Kevin', 'Kevin@abc.com', 41, 4)
('Ironman', 'Ironman@abc.com', 45, 5)
('JohnnyDepp', 'JohnnyDepp@abc.com', 55, 6)
('Tina', 'Tina@abc.com', 25, 7)

## Limit and Ordering

In [232]:
mydb = mysql.connector.connect(
    host = "172.28.0.2",
    user = "root",
    passwd = "123456",
    database = "testdb")

In [233]:
my_cursor = mydb.cursor()

In [234]:
my_cursor.execute("SELECT * FROM users LIMIT 3")

In [235]:
result = my_cursor.fetchall()

In [236]:
for row in result:
    print(row)

('John', 'john@abc.com', 40, 1)
('Tim', 'Tim@abc.com', 20, 2)
('Mary', 'Mary@abc.com', 30, 3)

### OFFSET

In [237]:
my_cursor.execute("SELECT * FROM users LIMIT 3 OFFSET 1")

In [238]:
result = my_cursor.fetchall()

In [239]:
for row in result:
    print(row)

('Tim', 'Tim@abc.com', 20, 2)
('Mary', 'Mary@abc.com', 30, 3)
('Kevin', 'Kevin@abc.com', 41, 4)

### Order

In [253]:
my_cursor.execute("SELECT * FROM users ORDER BY age DESC")

In [254]:
result = my_cursor.fetchall()

In [255]:
num_fields = len(my_cursor.description)
field_names = [i[0] for i in my_cursor.description]

In [256]:
df = []

In [257]:
for record in result:
    df.append(list(record))

In [258]:
new_df = pd.DataFrame(columns = field_names, data = df)

In [259]:
new_df

         name               email  age  user_id
0  JohnnyDepp  JohnnyDepp@abc.com   55        6
1     Ironman     Ironman@abc.com   45        5
2       Kevin       Kevin@abc.com   41        4
3        John        john@abc.com   40        1
4        Mary        Mary@abc.com   30        3
5        Tina        Tina@abc.com   25        7
6         Tim         Tim@abc.com   20        2

In [264]:
my_cursor.execute("SELECT * FROM users ORDER BY age ASC")

In [265]:
result = my_cursor.fetchall()

In [266]:
df = []

In [267]:
for record in result:
    df.append(list(record))

In [268]:
new_df = pd.DataFrame(columns = field_names, data = df)

In [269]:
new_df

         name               email  age  user_id
0         Tim         Tim@abc.com   20        2
1        Tina        Tina@abc.com   25        7
2        Mary        Mary@abc.com   30        3
3        John        john@abc.com   40        1
4       Kevin       Kevin@abc.com   41        4
5     Ironman     Ironman@abc.com   45        5
6  JohnnyDepp  JohnnyDepp@abc.com   55        6

## Delete Records

In [270]:
mydb = mysql.connector.connect(
    host = "172.28.0.2",
    user = "root",
    passwd = "123456",
    database = "testdb")

In [271]:
my_cursor = mydb.cursor()

In [273]:
my_cursor.execute("DELETE FROM users WHERE user_id = 3")

In [274]:
mydb.commit()

In [275]:
my_cursor.execute("SELECT * FROM users")

In [276]:
result = my_cursor.fetchall()

In [277]:
for row in result:
    print(row)

('John', 'john@abc.com', 40, 1)
('Tim', 'Tim@abc.com', 20, 2)
('Kevin', 'Kevin@abc.com', 41, 4)
('Ironman', 'Ironman@abc.com', 45, 5)
('JohnnyDepp', 'JohnnyDepp@abc.com', 55, 6)
('Tina', 'Tina@abc.com', 25, 7)

## Delete A Table And Backups

In [278]:
mydb = mysql.connector.connect(
    host = "172.28.0.2",
    user = "root",
    passwd = "123456",
    database = "testdb")

In [279]:
my_cursor = mydb.cursor()

In [285]:
my_sql = "DROP TABLE IF EXISTS users"